app/Http/Controllers/belongingsController.php

select * from `belongings`
---
    public function index() {
        $belongings = Belongings::all();