app/Http/Controllers/MountainController.php

select * from `Mountain`
select * from `Mountain` order by `id` desc limit 5 offset 5
select count(*) as aggregate from `Mountain`
---
    public function index(Request $request){
        $data = Mountain::all();
        $data =\App\Mountain::orderby('id','desc')->paginate(5);